### Forest Calibnet Infrastructure  Plan: success

<details><summary>Show Plan</summary>

```
module.calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.calibnet.data.digitalocean_project.forest_project: Reading...
module.calibnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4127341138294685345]
module.calibnet.digitalocean_droplet.forest_observability: Refreshing state... [id=349090423]
module.calibnet.digitalocean_droplet.forest: Refreshing state... [id=349090427]
module.calibnet.digitalocean_firewall.forest_observability_firewall: Refreshing state... [id=4ae9f4f8-ed9b-49a2-bb0c-c67eb0ee3567]
module.calibnet.local_file.inventory: Refreshing state... [id=59683b3e84644e9890e6229969d31c076129949c]
module.calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=775546bd-1330-4588-81d7-7affd2a0d8e9]
module.calibnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.calibnet.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = <<-EOT
            [forest]
            64.225.98.247
            [observability]
            167.172.96.73
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts_calibnet"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>